number = int(input('Введите число: '))
print(f'Следующее за числом {number} число: {number+1}',
      f'Для числа {number} предыдущее число: {number-1}',
      sep='\n')


# Введите число: 20
# Следующее за числом 20 число: 21
# Для числа 20 предыдущее число: 19

# ДОБАВИТЬ: результат выполнения программы с собственными данными
# КОММЕНТАРИЙ: выполняйте свой код с данными из примеров, чтобы проверить себя, но затем обязательно выполняйте с собственными данными для дополнительной проверки


# ИТОГ: отлично — 3/3
